Project #1 SOAP Project ISBN Checker.postman_collection.json

{
	"info": {
		"_postman_id": "1eb7133c-9fac-4990-8f90-f0560928b99e",
		"name": "Project #1 SOAP Project ISBN Checker",
		"schema": "https://schema.getpostman.com/json/collection/v2.0.0/collection.json",
		"_exporter_id": "16190403",
		"_collection_link": "https://www.postman.com/sahajajayachandran123/workspace/atb12x/collection/16190403-1eb7133c-9fac-4990-8f90-f0560928b99e?action=share&source=collection_link&creator=16190403"
	},
	"item": [
		{
			"name": "TC1 POSITIVE",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <IsValidISBN10 xmlns=\"http://webservices.daehosting.com/ISBN\">\r\n      <sISBN>0-19-852663-6</sISBN>\r\n    </IsValidISBN10>\r\n  </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "https://webservices.daehosting.com/services/isbnservice.wso"
			},
			"response": []
		},
		{
			"name": "TC2 NEGATIVE",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <IsValidISBN10 xmlns=\"http://webservices.daehosting.com/ISBN\">\r\n      <sISBN>abc</sISBN>\r\n    </IsValidISBN10>\r\n  </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "https://webservices.daehosting.com/services/isbnservice.wso"
			},
			"response": []
		}
	]
}